{
  "profile": {
    "title": "Profile",
    "name": "Carlos Vásquez Sánchez",
    "presentation": {
      "v1": "I started programming web pages and personal projects at the age of 17. I am currently studying competitive programming at the Complutense University of Madrid, in addition to a Higher Degree in Multiplatform Application Development. I am 20 years old and I am from Valladolid (Castilla y León).",
      "v2": "I can adapt to any language, I believe in the importance of TDD, documentation, and good development practices."
    }
  },
  "projects": {
    "title": "Projects",
    "thefluentspanishhouse": {
      "name": "The Fluent Spanish House",
      "description": "Spanish academy, with social media, blog, private class subscription, and newsletter with digital marketing implementation using Mailchimp, made in React with TypeScript, .tsx",
      "real": true
    },
    "olimpiadas-informaticas": {
      "name": "Informatics Olympiad",
      "description": "Online classes from UCM (Complutense University of Madrid) on competitive programming, with C++ and Java exercises"
    },
    "elend-talk": {
      "name": "Chat with PDF",
      "description": "Fluid conversation with Ollama and Deepseek about a user-uploaded PDF, with real-time chat history and file upload implementation, made with Astro and SvelteKit"
    },
    "coworking-space": {
      "name": "Coworking",
      "description": "Coworking platform (API) with room reservations, events, and users. Made with SpringBoot (Java), roles and permissions (Spring Security, JWT), documentation (Swagger and Javadoc), proposed by the BytesColaborativos community"
    }
  },
  "experience": {
    "title": "Experience",
    "description": "I have experience working with a wide variety of programming languages and frameworks, including JavaScript, TypeScript, C++, Java, Astro and React. I have developed significant projects in each of these languages, which has allowed me to acquire solid knowledge and practical skills in software development.",
    "technologies": "I have also worked with various tools and libraries that have allowed me to delve into the internal workings and development environment, such as MongoDB, MySQL, Firebase, Vercel, Cloudflare, Tailwind, NodeJS, virtual machine management, Git, GitHub, GitKraken, continuous integration with GitHub Actions, among others."
  },
  "contact": {
    "title": "Contact",
    "email": "carlosrvasquezsanchez@gmail.com",
    "formEmail": "Your email",
    "formMessage": "Message",
    "formSubmit": "Send"
  }
}
