{
  "profile": {
    "title": "Perfil",
    "subtitle": "Desarrollador de Software",
    "name": "Carlos Raúl Vásquez Sánchez",
    "presentation": {
      "v1": "Comencé a programar proyectos personales a los dieciocho años. Actualmente estoy estudiando un Grado Superior de Desarrollo de Aplicaciones Multiplataforma, también estudié un curso de programación algorítmica online de la Universidad Complutense de Madrid, y hago servicios y proyectos autodidactas. Tengo veintiún años y soy de España (Castilla y León, Valladolid).",
      "v2": "Puedo adaptarme a cualquier lenguaje, creo en la importancia de  documentación y las buenas prácticas de desarrollo."
    }
  },
  "projects": {
    "title": "Proyectos",
    "amanahacademia": {
      "name": "Amanah Academia",
      "description": "Academia de enseñanza del español, mediante un enfoque culturalmente inmersivo. Dirigida por Ana Ortega, conecta a estudiantes con profesores nativos que imparten las clases en el idioma nativo del estudiante, facilitando un aprendizaje más natural y efectivo. backend en Rust, frontend en Astro."
    },
    "olimpiadas-informaticas": {
      "name": "Olimpiada Informática Española",
      "description": "Clases online de la UCM (Universidad Complutense de Madrid) de programación competitiva, con ejercicios de C++ y Java."
    },
    "elend-talk": {
      "name": "Chat con PDF",
      "description": "Conversación fluida con Ollama y Deepseek sobre un PDF pasado por el usuario, con implementación de chat con historial en tiempo real y subida de archivos, Astro y SvelteKit."
    },
    "thefluentspanishhouse": {
      "name": "The Fluent Spanish House",
      "description": "Academia de Español, con socialmedia, blog, suscripción a clases particulares y newsletter, hecho con React y TypeScript."
    },
    "octa-rust": {
      "name": "OctaRust",
      "description": "Octa rust es un aplicacion par aprender a tocar piano de manera divertida y entretenida, con un enfoque en la gamificación y el aprendizaje progresivo. La aplicación está diseñada para ayudar a los usuarios a aprender a tocar el piano desde cero, sin necesidad de conocimientos previos."
    },
    "bytes-colaborativos": {
      "name": "BytesColaborativos",
      "description": "Proyectos en Java. Con SpringBoot, Spring Security, JWT, documentación con Swagger y Javadoc, colas Kafka, etc.. propuesto por la comunidad BytesColaborativos."
    }
  },
  "experience": {
    "title": "Experiencia",
    "description": "Tengo experiencia con <strong class='strong'>lenguajes y frameworks</strong> como Rust, C++, TypeScript, Java, Spring Boot, TypeScript, Astro, React, Python, motores como Unreal Engine y Unity.<br> He desarrollado proyectos significativos en cada uno, adquiriendo un sólido conocimiento en desarrollo de software.<br>",
    "technologies": "También he trabajado con <strong class='strong'>herramientas</strong> como MongoDB, Firebase, Vercel, Cloudflare, Tailwind, Node.js, máquinas virtuales, Git, GitHub e integración continua con GitHub Actions.<br> Además, tengo experiencia en proyectos colaborativos en equipo utilizando Jira y Taiga."
  },
  "history": {
    "title": "Historial Laboral",
    "viewFullResume": "Ver currículum completo",
    "jobs": [
      {
        "title": "Prácticas, Desarrollador Unreal Engine 5",
        "company": "Rapture Games",
        "date": "04/2025 - 06/2025",
        "description": "Durante mis prácticas, he trabajado en el desarrollo de un proyecto con Unreal Engine centrado en la simulación de físicas orbitales. He implementado el equilibrio entre fuerzas centrífugas y centrípetas, así como el uso de propelente para permitir el desplazamiento entre órbitas. Además, he recreado shaders personalizados y modelos 3D, integrándolos en el entorno de simulación. Una experiencia que me ha permitido aplicar y ampliar mis conocimientos en programación, física y gráficos por ordenador."
      },
      {
        "title": "Prácticas, Soporte Técnico Nuevas Tecnologías",
        "company": "Diputación de Valladolid",
        "date": "04/2024 - 06/2024",
        "description": "Restauración completa de inventario de equipos tecnológicos. Desarollo de scripts en VBA para identificar y reguistrar equipos para la optimizacion del proceso de recopilacion y organización de datos. Colaboración con el equipo en tareas adminsitrativas y de soporte técnico relacionadas con la gestión de activos tecnológicos. Iniciativa propia para implementar soluciones eficientes, mejorando los tiempos y la precisión del inventario."
      }
    ]
  },
  "contact": {
    "title": "Contacto",
    "email": "carlosvassan@gmail.com",
    "formEmail": "Tu email",
    "formMessage": "Mensaje",
    "formSubmit": "Enviar"
  }
}
